
Pusher: @MarkWarneke, Action: `pull_request`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>


```terraform
Acquiring state lock. This may take a few moments...
module.shared.azurerm_resource_group.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared]
module.load-more.azurerm_resource_group.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/load-more]
module.aml.azurerm_resource_group.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-aml]
module.network.azurerm_resource_group.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-vnet]
module.network.random_id.randomId: Refreshing state... [id=Qg7W0bnvEqvOZg]
module.network.azurerm_network_security_group.allow80: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-vnet/providers/Microsoft.Network/networkSecurityGroups/markwarnekeme-allow-nsg]
module.network.azurerm_virtual_network.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-vnet/providers/Microsoft.Network/virtualNetworks/markwarnekeme-vnet]
module.aml.random_id.randomId: Refreshing state... [id=qYIc6p6w5IyeVQ]
module.shared.random_id.randomId: Refreshing state... [id=64mJpksEEewRxA]
module.shared.module.container_registry.azurerm_container_registry.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.ContainerRegistry/registries/markwarnekeme]
module.aml.module.machine_learning_workspace.module.application_insights.azurerm_application_insights.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-aml/providers/microsoft.insights/components/markwarnekemeamla9821cea9eb0e48c9e55]
module.load-more.random_id.randomId: Refreshing state... [id=krUZRQhKcaZVxg]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_workspace.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.OperationalInsights/workspaces/markwarnekeme]
module.load-more.module.application_insights.azurerm_application_insights.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/load-more/providers/microsoft.insights/components/load-more]
module.shared.module.event_hub.azurerm_eventhub_namespace.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.EventHub/namespaces/markwarnekeme]
module.load-more.module.key_vault.azurerm_key_vault.kv: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/load-more/providers/Microsoft.KeyVault/vaults/load-more]
module.load-more.module.cosmosdb_account.azurerm_cosmosdb_account.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/load-more/providers/Microsoft.DocumentDB/databaseAccounts/load-more]
module.shared.module.key_vault.azurerm_key_vault.kv: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.KeyVault/vaults/markwarnekemeshared]
module.network.azurerm_subnet.backend_virtual_node: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-vnet/providers/Microsoft.Network/virtualNetworks/markwarnekeme-vnet/subnets/markwarnekeme-backend-aci]
module.network.azurerm_subnet.backend: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-vnet/providers/Microsoft.Network/virtualNetworks/markwarnekeme-vnet/subnets/markwarnekeme-backend]
module.network.azurerm_subnet.frontend: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-vnet/providers/Microsoft.Network/virtualNetworks/markwarnekeme-vnet/subnets/markwarnekeme-frontend]
module.network.azurerm_subnet_network_security_group_association.frontend-allow80: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-vnet/providers/Microsoft.Network/virtualNetworks/markwarnekeme-vnet/subnets/markwarnekeme-frontend]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_solution.container: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/markwarnekeme-shared/providers/Microsoft.OperationsManagement/solutions/ContainerInsights(markwarnekeme)]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_solution.updates: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/markwarnekeme-shared/providers/Microsoft.OperationsManagement/solutions/Updates(markwarnekeme)]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_solution.infrastructure: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/markwarnekeme-shared/providers/Microsoft.OperationsManagement/solutions/InfrastructureInsights(markwarnekeme)]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_solution.keyvault: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/markwarnekeme-shared/providers/Microsoft.OperationsManagement/solutions/KeyVaultAnalytics(markwarnekeme)]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_solution.maleware: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/markwarnekeme-shared/providers/Microsoft.OperationsManagement/solutions/AntiMalware(markwarnekeme)]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_solution.activity: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/markwarnekeme-shared/providers/Microsoft.OperationsManagement/solutions/AzureActivity(markwarnekeme)]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_solution.nsg: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/markwarnekeme-shared/providers/Microsoft.OperationsManagement/solutions/AzureNSGAnalytics(markwarnekeme)]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_solution.security: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/markwarnekeme-shared/providers/Microsoft.OperationsManagement/solutions/Security(markwarnekeme)]
module.shared.module.key_vault.azurerm_key_vault_access_policy.sp_terraform: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.KeyVault/vaults/markwarnekemeshared/objectId/dde8affe-86ad-46e2-b728-691e676b4eb3]
module.shared.module.key_vault.azurerm_monitor_diagnostic_setting.kv_diag_settings: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.KeyVault/vaults/markwarnekemeshared|markwarnekemeshared]
module.load-more.module.key_vault.azurerm_key_vault_access_policy.sp_terraform: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/load-more/providers/Microsoft.KeyVault/vaults/load-more/objectId/dde8affe-86ad-46e2-b728-691e676b4eb3]
module.load-more.module.key_vault.azurerm_monitor_diagnostic_setting.kv_diag_settings: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/load-more/providers/Microsoft.KeyVault/vaults/load-more|load-more]
module.load-more.module.kubernetes_cluster.azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/load-more/providers/Microsoft.ContainerService/managedClusters/load-more]
module.shared.module.container_registry.azurerm_monitor_diagnostic_setting.diagnostics: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.ContainerRegistry/registries/markwarnekeme|markwarnekeme]
module.load-more.module.key_vault.null_resource.wait_policy: Refreshing state... [id=9121554231835175228]
module.shared.module.key_vault.null_resource.wait_policy: Refreshing state... [id=8045184661042629246]
module.shared.module.event_hub.azurerm_eventhub.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.EventHub/namespaces/markwarnekeme/eventhubs/markwarnekeme]
module.shared.module.event_hub.azurerm_monitor_diagnostic_setting.eventhub_namespace_diag_settings: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.EventHub/namespaces/markwarnekeme|markwarnekeme]
module.load-more.module.kubernetes_cluster.azurerm_monitor_diagnostic_setting.diagnostics: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/load-more/providers/Microsoft.ContainerService/managedClusters/load-more|load-more]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.aml.module.machine_learning_workspace.azurerm_machine_learning_workspace.main will be created
  + resource "azurerm_machine_learning_workspace" "main" {
      + application_insights_id = "/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-aml/providers/microsoft.insights/components/markwarnekemeamla9821cea9eb0e48c9e55"
      + container_registry_id   = "/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.ContainerRegistry/registries/markwarnekeme"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + location                = "germanywestcentral"
      + name                    = "markwarnekemeaml"
      + resource_group_name     = "markwarnekeme-aml"
      + sku_name                = "Basic"
      + storage_account_id      = (known after apply)
      + tags                    = {
          + "id"        = "a9821cea9eb0e48c9e55"
          + "terraform" = "true"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.aml.module.machine_learning_workspace.azurerm_storage_account.main will be created
  + resource "azurerm_storage_account" "main" {
      + access_tier                      = (known after apply)
      + account_kind                     = "StorageV2"
      + account_replication_type         = "GRS"
      + account_tier                     = "Standard"
      + allow_blob_public_access         = false
      + enable_https_traffic_only        = true
      + id                               = (known after apply)
      + is_hns_enabled                   = false
      + large_file_share_enabled         = (known after apply)
      + location                         = "germanywestcentral"
      + min_tls_version                  = "TLS1_0"
      + name                             = "markwarnekemeamla9821ce"
      + primary_access_key               = (sensitive value)
      + primary_blob_connection_string   = (sensitive value)
      + primary_blob_endpoint            = (known after apply)
      + primary_blob_host                = (known after apply)
      + primary_connection_string        = (sensitive value)
      + primary_dfs_endpoint             = (known after apply)
      + primary_dfs_host                 = (known after apply)
      + primary_file_endpoint            = (known after apply)
      + primary_file_host                = (known after apply)
      + primary_location                 = (known after apply)
      + primary_queue_endpoint           = (known after apply)
      + primary_queue_host               = (known after apply)
      + primary_table_endpoint           = (known after apply)
      + primary_table_host               = (known after apply)
      + primary_web_endpoint             = (known after apply)
      + primary_web_host                 = (known after apply)
      + resource_group_name              = "markwarnekeme-aml"
      + secondary_access_key             = (sensitive value)
      + secondary_blob_connection_string = (sensitive value)
      + secondary_blob_endpoint          = (known after apply)
      + secondary_blob_host              = (known after apply)
      + secondary_connection_string      = (sensitive value)
      + secondary_dfs_endpoint           = (known after apply)
      + secondary_dfs_host               = (known after apply)
      + secondary_file_endpoint          = (known after apply)
      + secondary_file_host              = (known after apply)
      + secondary_location               = (known after apply)
      + secondary_queue_endpoint         = (known after apply)
      + secondary_queue_host             = (known after apply)
      + secondary_table_endpoint         = (known after apply)
      + secondary_table_host             = (known after apply)
      + secondary_web_endpoint           = (known after apply)
      + secondary_web_host               = (known after apply)
      + tags                             = {
          + "id"        = "a9821cea9eb0e48c9e55"
          + "terraform" = "true"
        }

      + blob_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }
    }

  # module.load-more.module.kubernetes_cluster.azurerm_monitor_diagnostic_setting.diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics" {
        id                         = "/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/load-more/providers/Microsoft.ContainerService/managedClusters/load-more|load-more"
        name                       = "load-more"
        # (2 unchanged attributes hidden)


      + metric {
          + category = "API Server (PREVIEW)"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = false
            }
        }
      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
        # (7 unchanged blocks hidden)
    }

  # module.aml.module.machine_learning_workspace.module.key_vault.azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy               = (known after apply)
      + enabled_for_disk_encryption = true
      + id                          = (known after apply)
      + location                    = "germanywestcentral"
      + name                        = "markwarnekemeamla9821ce"
      + resource_group_name         = "markwarnekeme-aml"
      + sku_name                    = "premium"
      + soft_delete_enabled         = true
      + tags                        = {
          + "id"        = "a9821cea9eb0e48c9e55"
          + "terraform" = "true"
        }
      + tenant_id                   = "72f988bf-86f1-41af-91ab-2d7cd011db47"
      + vault_uri                   = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.aml.module.machine_learning_workspace.module.key_vault.azurerm_key_vault_access_policy.sp_terraform will be created
  + resource "azurerm_key_vault_access_policy" "sp_terraform" {
      + certificate_permissions = [
          + "create",
          + "delete",
          + "deleteissuers",
          + "get",
          + "getissuers",
          + "import",
          + "list",
          + "listissuers",
          + "managecontacts",
          + "manageissuers",
          + "setissuers",
          + "update",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "backup",
          + "create",
          + "decrypt",
          + "delete",
          + "encrypt",
          + "get",
          + "import",
          + "list",
          + "purge",
          + "recover",
          + "restore",
          + "sign",
          + "unwrapKey",
          + "update",
          + "verify",
          + "wrapKey",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "dde8affe-86ad-46e2-b728-691e676b4eb3"
      + secret_permissions      = [
          + "backup",
          + "delete",
          + "get",
          + "list",
          + "purge",
          + "recover",
          + "restore",
          + "set",
        ]
      + tenant_id               = "72f988bf-86f1-41af-91ab-2d7cd011db47"
    }

  # module.aml.module.machine_learning_workspace.module.key_vault.azurerm_monitor_diagnostic_setting.kv_diag_settings will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv_diag_settings" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.OperationalInsights/workspaces/markwarnekeme"
      + name                       = "markwarnekemeamla9821ce"
      + target_resource_id         = (known after apply)

      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
    }

  # module.aml.module.machine_learning_workspace.module.key_vault.null_resource.wait_policy will be created
  + resource "null_resource" "wait_policy" {
      + id = (known after apply)
    }

Plan: 6 to add, 1 to change, 0 to destroy.

```


</details>
